
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7785963382)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * google_identity_platform_config.firebase-auth-google
  * google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.firebase-auth
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_identity_platform_config.firebase-auth-google will be created
  + resource "google_identity_platform_config" "firebase-auth-google" {
      + authorized_domains         = (known after apply)
      + autodelete_anonymous_users = true
      + id                         = (known after apply)
      + name                       = (known after apply)
      + project                    = "gig-japan-398904"

      + sign_in {
          + allow_duplicate_emails = false
          + hash_config            = (known after apply)

          + anonymous {
              + enabled = false
            }

          + email {
              + enabled = false
            }

          + phone_number {
              + enabled = false
            }
        }

      + sms_region_config {
          + allowlist_only {
              + allowed_regions = [
                  + "JP",
                ]
            }
        }
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be created
  + resource "google_project_service" "firebase-apis" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "firebase.googleapis.com"
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "firebase-apis" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "serviceusage.googleapis.com"
    }

  # google_project_service.firebase-auth will be created
  + resource "google_project_service" "firebase-auth" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "identitytoolkit.googleapis.com"
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":45,"Program":"tfcmt","SHA1":"09aa0447953b1d029322ee01e618612ba025022a","Vars":{},"WorkflowName":"iaac_plan"} -->